NextFOAM-2404/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet_Dual_Bottleneck/losses-mass-70-30/reEval/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SIMPLE          
{
    nNonOrthogonalCorrectors 0;
}

solvers
{
    "p|pa.*|bTilda"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0.1;
    }

    "U|Ua.*"
    {
        solver      PBiCGStab;
        preconditioner   DILU;
        tolerance   1e-9;
        relTol      0.1;
    };
}

relaxationFactors 
{
    fields
    {
        p               0.3;
       "pa.*"           0.2;
    }
    equations
    {
        U               0.7;
       "Ua.*"           0.5;
    }
}

// ************************************************************************* //
